{
    "success_messages": [
        "You're in luck! Someone tossed you **${money}**",
        "A kind stranger handed you **${money}** out of pity",
        "You found **${money}** lying on the ground Lucky you!",
        "An old friend stopped by and dropped **${money}** in your lap",
        "You rummaged through the trash and discovered **${money}**",
        "A generous passerby gave you **${money}** when they heard your plea",
        "A random dog trotted by carrying **${money}** in a pouch Score!",
        "Your heartfelt story moved someone enough to donate **${money}**",
        "You were scrounging for scraps and found **${money}** in a hidden pocket!",
        "A traveling merchant slipped you **${money}** out of sympathy",
        "Your ancestors must be smiling on you; you discovered **${money}** at your feet",
        "A gust of wind blew **${money}** straight into your hands!",
        "You plucked **${money}** off the back of a passing wagon",
        "A local baron overheard your pleas and flung **${money}** your way",
        "You unearthed **${money}** while digging around for spare change",
        "A stray cat led you to a hidden stash of **${money}**!",
        "A traveling bard took pity on you and shared **${money}** from their tip jar",
        "You were rummaging through the lost-and-found bin and discovered **${money}**!",
        "A sudden donation drive showered you with **${money}$** Lucky day!",
        "You tripped and landed on a small pouch containing **${money}**"
    ],
    "fail_messages": [
        "No one spared a single coin for you",
        "A guard shooed you away before you could collect any money",
        "You picked up what looked like a coin, but it was just a shiny rock",
        "Everyone hurried past and ignored your pleas",
        "You tried singing a sad song, but no one donated a thing",
        "You thought you found a gold coin, but it turned out to be a bottle cap",
        "A street performer stole the crowd's attention, leaving you with empty pockets",
        "You knocked over your own cup, scattering your hopes of spare change",
        "A sudden downpour washed away any potential ",
        "Someone pretended to give you money but handed you a piece of paper instead",
        "Your sign fell apart, and no one knew you were begging",
        "Your pleas echoed into the distance, but no one heard them",
        "You reached into a wishing well and ended up soaking wet (and still broke)",
        "A pickpocket stole your last few  before anyone else could give more",
        "Your attempt at a tearful performance only earned you strange looks",
        "A pigeon swooped in and scared off a kind donor at the last second",
        "The crowd was too busy watching a juggler to notice you",
        "A gust of wind swept your cup away before any  landed inside",
        "Security escorted you away from the busy spot you were begging at",
        "You spotted a coin on the ground, but someone else snatched it first"
    ],
    "loss_messages": [
        "You tripped on a sidewalk crack and dropped **${money}**",
        "A pickpocket slipped by and stole **${money}**",
        "You accidentally paid for a stranger's coffee losing **${money}**",
        "A sudden gust of wind blew away **${money}** you were holding",
        "You left your wallet open and lost **${money}**",
        "A mischief of rats scurried off with **${money}**",
        "You tried to bribe a guard but ended up losing **${money}**",
        "You broke a fragile vase in a shop and had to pay **${money}**",
        "You fell for a scam and lost **${money}**",
        "You owed a debt collector **${money}**",
        "You dropped your money in a puddle and it floated away losing **${money}**",
        "A sneaky fox rummaged through your bag and took **${money}**",
        "You had to pay a hefty fine of **${money}**",
        "You absentmindedly put your money in the donation box losing **${money}**",
        "You bet on a rigged game and lost **${money}**",
        "Your wallet developed a hole and out fell **${money}**",
        "You left **${money}** on a bus seat and it was gone by the time you realized",
        "You tried to pay a toll but overpaid by **${money}**",
        "You got robbed at knifepoint and lost **${money}**",
        "You had to pay for a parking ticket that cost you **${money}**"
    ]
}